Benchmarks/results_hummingbird.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarkHummingbird.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 900 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 900/900 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 900 VUs  0m01.0s/1m0s

running (0m02.0s), 900/900 VUs, 828 complete and 0 interrupted iterations
default   [   3% ] 900 VUs  0m02.0s/1m0s

running (0m03.0s), 900/900 VUs, 1576 complete and 0 interrupted iterations
default   [   5% ] 900 VUs  0m03.0s/1m0s

running (0m04.0s), 900/900 VUs, 2476 complete and 0 interrupted iterations
default   [   7% ] 900 VUs  0m04.0s/1m0s

running (0m05.0s), 900/900 VUs, 3376 complete and 0 interrupted iterations
default   [   8% ] 900 VUs  0m05.0s/1m0s

running (0m06.0s), 900/900 VUs, 4276 complete and 0 interrupted iterations
default   [  10% ] 900 VUs  0m06.0s/1m0s

running (0m07.0s), 900/900 VUs, 5176 complete and 0 interrupted iterations
default   [  12% ] 900 VUs  0m07.0s/1m0s

running (0m08.0s), 900/900 VUs, 6076 complete and 0 interrupted iterations
default   [  13% ] 900 VUs  0m08.0s/1m0s

running (0m09.0s), 900/900 VUs, 6976 complete and 0 interrupted iterations
default   [  15% ] 900 VUs  0m09.0s/1m0s

running (0m10.0s), 900/900 VUs, 7876 complete and 0 interrupted iterations
default   [  17% ] 900 VUs  0m10.0s/1m0s

running (0m11.0s), 900/900 VUs, 8776 complete and 0 interrupted iterations
default   [  18% ] 900 VUs  0m11.0s/1m0s

running (0m12.0s), 900/900 VUs, 9676 complete and 0 interrupted iterations
default   [  20% ] 900 VUs  0m12.0s/1m0s

running (0m13.0s), 900/900 VUs, 10576 complete and 0 interrupted iterations
default   [  22% ] 900 VUs  0m13.0s/1m0s

running (0m14.0s), 900/900 VUs, 11476 complete and 0 interrupted iterations
default   [  23% ] 900 VUs  0m14.0s/1m0s

running (0m15.0s), 900/900 VUs, 12376 complete and 0 interrupted iterations
default   [  25% ] 900 VUs  0m15.0s/1m0s

running (0m16.0s), 900/900 VUs, 13276 complete and 0 interrupted iterations
default   [  27% ] 900 VUs  0m16.0s/1m0s

running (0m17.0s), 900/900 VUs, 14176 complete and 0 interrupted iterations
default   [  28% ] 900 VUs  0m17.0s/1m0s

running (0m18.0s), 900/900 VUs, 15024 complete and 0 interrupted iterations
default   [  30% ] 900 VUs  0m18.0s/1m0s

running (0m19.0s), 900/900 VUs, 15920 complete and 0 interrupted iterations
default   [  32% ] 900 VUs  0m19.0s/1m0s

running (0m20.0s), 900/900 VUs, 16820 complete and 0 interrupted iterations
default   [  33% ] 900 VUs  0m20.0s/1m0s

running (0m21.0s), 900/900 VUs, 17720 complete and 0 interrupted iterations
default   [  35% ] 900 VUs  0m21.0s/1m0s

running (0m22.0s), 900/900 VUs, 18620 complete and 0 interrupted iterations
default   [  37% ] 900 VUs  0m22.0s/1m0s

running (0m23.0s), 900/900 VUs, 19520 complete and 0 interrupted iterations
default   [  38% ] 900 VUs  0m23.0s/1m0s

running (0m24.0s), 900/900 VUs, 20420 complete and 0 interrupted iterations
default   [  40% ] 900 VUs  0m24.0s/1m0s

running (0m25.0s), 900/900 VUs, 21320 complete and 0 interrupted iterations
default   [  42% ] 900 VUs  0m25.0s/1m0s

running (0m26.0s), 900/900 VUs, 22220 complete and 0 interrupted iterations
default   [  43% ] 900 VUs  0m26.0s/1m0s

running (0m27.0s), 900/900 VUs, 23120 complete and 0 interrupted iterations
default   [  45% ] 900 VUs  0m27.0s/1m0s

running (0m28.0s), 900/900 VUs, 24020 complete and 0 interrupted iterations
default   [  47% ] 900 VUs  0m28.0s/1m0s

running (0m29.0s), 900/900 VUs, 24920 complete and 0 interrupted iterations
default   [  48% ] 900 VUs  0m29.0s/1m0s

running (0m30.0s), 900/900 VUs, 25820 complete and 0 interrupted iterations
default   [  50% ] 900 VUs  0m30.0s/1m0s

running (0m31.0s), 900/900 VUs, 26720 complete and 0 interrupted iterations
default   [  52% ] 900 VUs  0m31.0s/1m0s

running (0m32.0s), 900/900 VUs, 27620 complete and 0 interrupted iterations
default   [  53% ] 900 VUs  0m32.0s/1m0s

running (0m33.0s), 900/900 VUs, 28520 complete and 0 interrupted iterations
default   [  55% ] 900 VUs  0m33.0s/1m0s

running (0m34.0s), 900/900 VUs, 29418 complete and 0 interrupted iterations
default   [  57% ] 900 VUs  0m34.0s/1m0s

running (0m35.0s), 900/900 VUs, 30063 complete and 0 interrupted iterations
default   [  58% ] 900 VUs  0m35.0s/1m0s

running (0m36.0s), 900/900 VUs, 30797 complete and 0 interrupted iterations
default   [  60% ] 900 VUs  0m36.0s/1m0s

running (0m37.0s), 900/900 VUs, 31662 complete and 0 interrupted iterations
default   [  62% ] 900 VUs  0m37.0s/1m0s

running (0m38.0s), 900/900 VUs, 32547 complete and 0 interrupted iterations
default   [  63% ] 900 VUs  0m38.0s/1m0s

running (0m39.0s), 900/900 VUs, 33447 complete and 0 interrupted iterations
default   [  65% ] 900 VUs  0m39.0s/1m0s

running (0m40.0s), 900/900 VUs, 34346 complete and 0 interrupted iterations
default   [  67% ] 900 VUs  0m40.0s/1m0s

running (0m41.0s), 900/900 VUs, 35245 complete and 0 interrupted iterations
default   [  68% ] 900 VUs  0m41.0s/1m0s

running (0m42.0s), 900/900 VUs, 36140 complete and 0 interrupted iterations
default   [  70% ] 900 VUs  0m42.0s/1m0s

running (0m43.0s), 900/900 VUs, 37038 complete and 0 interrupted iterations
default   [  72% ] 900 VUs  0m43.0s/1m0s

running (0m44.0s), 900/900 VUs, 37935 complete and 0 interrupted iterations
default   [  73% ] 900 VUs  0m44.0s/1m0s

running (0m45.0s), 900/900 VUs, 38830 complete and 0 interrupted iterations
default   [  75% ] 900 VUs  0m45.0s/1m0s

running (0m46.0s), 900/900 VUs, 39720 complete and 0 interrupted iterations
default   [  77% ] 900 VUs  0m46.0s/1m0s

running (0m47.0s), 900/900 VUs, 40617 complete and 0 interrupted iterations
default   [  78% ] 900 VUs  0m47.0s/1m0s

running (0m48.0s), 900/900 VUs, 41502 complete and 0 interrupted iterations
default   [  80% ] 900 VUs  0m48.0s/1m0s

running (0m49.0s), 900/900 VUs, 42385 complete and 0 interrupted iterations
default   [  82% ] 900 VUs  0m49.0s/1m0s

running (0m50.0s), 900/900 VUs, 43270 complete and 0 interrupted iterations
default   [  83% ] 900 VUs  0m50.0s/1m0s

running (0m51.0s), 900/900 VUs, 44170 complete and 0 interrupted iterations
default   [  85% ] 900 VUs  0m51.0s/1m0s

running (0m52.0s), 900/900 VUs, 45070 complete and 0 interrupted iterations
default   [  87% ] 900 VUs  0m52.0s/1m0s

running (0m53.0s), 900/900 VUs, 45970 complete and 0 interrupted iterations
default   [  88% ] 900 VUs  0m53.0s/1m0s

running (0m54.0s), 900/900 VUs, 46870 complete and 0 interrupted iterations
default   [  90% ] 900 VUs  0m54.0s/1m0s

running (0m55.0s), 900/900 VUs, 47770 complete and 0 interrupted iterations
default   [  92% ] 900 VUs  0m55.0s/1m0s

running (0m56.0s), 900/900 VUs, 48635 complete and 0 interrupted iterations
default   [  93% ] 900 VUs  0m56.0s/1m0s

running (0m57.0s), 900/900 VUs, 49522 complete and 0 interrupted iterations
default   [  95% ] 900 VUs  0m57.0s/1m0s

running (0m58.0s), 900/900 VUs, 50410 complete and 0 interrupted iterations
default   [  97% ] 900 VUs  0m58.0s/1m0s

running (0m59.0s), 900/900 VUs, 51296 complete and 0 interrupted iterations
default   [  98% ] 900 VUs  0m59.0s/1m0s

running (1m00.0s), 900/900 VUs, 52173 complete and 0 interrupted iterations
default   [ 100% ] 900 VUs  1m00.0s/1m0s

running (1m01.0s), 052/900 VUs, 53059 complete and 0 interrupted iterations
default ↓ [ 100% ] 900 VUs  1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.62ms min=0s       med=237.21µs max=207.36ms p(90)=3.74ms p(95)=7.27ms 
      { expected_response:true }...: avg=3.06ms min=103.85µs med=1.45ms   max=207.36ms p(90)=7.06ms p(95)=10.95ms
    http_req_failed................: 46.84% 24879 out of 53111
    http_reqs......................: 53111  870.446488/s

    EXECUTION
    iteration_duration.............: avg=1.02s  min=1s       med=1s       max=2.16s    p(90)=1.03s  p(95)=1.08s  
    iterations.....................: 53111  870.446488/s
    vus............................: 52     min=52             max=900
    vus_max........................: 900    min=900            max=900

    NETWORK
    data_received..................: 7.6 MB 125 kB/s
    data_sent......................: 2.2 MB 36 kB/s



running (1m01.0s), 000/900 VUs, 53111 complete and 0 interrupted iterations
default ✓ [ 100% ] 900 VUs  1m0s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarkHummingbird.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 900 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 900/900 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 900 VUs  0m01.0s/1m0s

running (0m02.0s), 900/900 VUs, 594 complete and 0 interrupted iterations
default   [   3% ] 900 VUs  0m02.0s/1m0s

running (0m03.0s), 900/900 VUs, 1447 complete and 0 interrupted iterations
default   [   5% ] 900 VUs  0m03.0s/1m0s

running (0m04.0s), 900/900 VUs, 2347 complete and 0 interrupted iterations
default   [   7% ] 900 VUs  0m04.0s/1m0s

running (0m05.0s), 900/900 VUs, 3247 complete and 0 interrupted iterations
default   [   8% ] 900 VUs  0m05.0s/1m0s

running (0m06.0s), 900/900 VUs, 4147 complete and 0 interrupted iterations
default   [  10% ] 900 VUs  0m06.0s/1m0s

running (0m07.0s), 900/900 VUs, 5047 complete and 0 interrupted iterations
default   [  12% ] 900 VUs  0m07.0s/1m0s

running (0m08.0s), 900/900 VUs, 5947 complete and 0 interrupted iterations
default   [  13% ] 900 VUs  0m08.0s/1m0s

running (0m09.0s), 900/900 VUs, 6847 complete and 0 interrupted iterations
default   [  15% ] 900 VUs  0m09.0s/1m0s

running (0m10.0s), 900/900 VUs, 7747 complete and 0 interrupted iterations
default   [  17% ] 900 VUs  0m10.0s/1m0s

running (0m11.0s), 900/900 VUs, 8647 complete and 0 interrupted iterations
default   [  18% ] 900 VUs  0m11.0s/1m0s

running (0m12.0s), 900/900 VUs, 9547 complete and 0 interrupted iterations
default   [  20% ] 900 VUs  0m12.0s/1m0s

running (0m13.0s), 900/900 VUs, 10447 complete and 0 interrupted iterations
default   [  22% ] 900 VUs  0m13.0s/1m0s

running (0m14.0s), 900/900 VUs, 11347 complete and 0 interrupted iterations
default   [  23% ] 900 VUs  0m14.0s/1m0s

running (0m15.0s), 900/900 VUs, 12247 complete and 0 interrupted iterations
default   [  25% ] 900 VUs  0m15.0s/1m0s

running (0m16.0s), 900/900 VUs, 13147 complete and 0 interrupted iterations
default   [  27% ] 900 VUs  0m16.0s/1m0s

running (0m17.0s), 900/900 VUs, 14047 complete and 0 interrupted iterations
default   [  28% ] 900 VUs  0m17.0s/1m0s

running (0m18.0s), 900/900 VUs, 14947 complete and 0 interrupted iterations
default   [  30% ] 900 VUs  0m18.0s/1m0s

running (0m19.0s), 900/900 VUs, 15847 complete and 0 interrupted iterations
default   [  32% ] 900 VUs  0m19.0s/1m0s

running (0m20.0s), 900/900 VUs, 16747 complete and 0 interrupted iterations
default   [  33% ] 900 VUs  0m20.0s/1m0s

running (0m21.0s), 900/900 VUs, 17647 complete and 0 interrupted iterations
default   [  35% ] 900 VUs  0m21.0s/1m0s

running (0m22.0s), 900/900 VUs, 18547 complete and 0 interrupted iterations
default   [  37% ] 900 VUs  0m22.0s/1m0s

running (0m23.0s), 900/900 VUs, 19447 complete and 0 interrupted iterations
default   [  38% ] 900 VUs  0m23.0s/1m0s

running (0m24.0s), 900/900 VUs, 20347 complete and 0 interrupted iterations
default   [  40% ] 900 VUs  0m24.0s/1m0s

running (0m25.0s), 900/900 VUs, 21247 complete and 0 interrupted iterations
default   [  42% ] 900 VUs  0m25.0s/1m0s

running (0m26.0s), 900/900 VUs, 22147 complete and 0 interrupted iterations
default   [  43% ] 900 VUs  0m26.0s/1m0s

running (0m27.0s), 900/900 VUs, 23047 complete and 0 interrupted iterations
default   [  45% ] 900 VUs  0m27.0s/1m0s

running (0m28.0s), 900/900 VUs, 23942 complete and 0 interrupted iterations
default   [  47% ] 900 VUs  0m28.0s/1m0s

running (0m29.0s), 900/900 VUs, 24618 complete and 0 interrupted iterations
default   [  48% ] 900 VUs  0m29.0s/1m0s

running (0m30.0s), 900/900 VUs, 25287 complete and 0 interrupted iterations
default   [  50% ] 900 VUs  0m30.0s/1m0s

running (0m31.0s), 900/900 VUs, 26187 complete and 0 interrupted iterations
default   [  52% ] 900 VUs  0m31.0s/1m0s

running (0m32.0s), 900/900 VUs, 27086 complete and 0 interrupted iterations
default   [  53% ] 900 VUs  0m32.0s/1m0s

running (0m33.0s), 900/900 VUs, 27985 complete and 0 interrupted iterations
default   [  55% ] 900 VUs  0m33.0s/1m0s

running (0m34.0s), 900/900 VUs, 28884 complete and 0 interrupted iterations
default   [  57% ] 900 VUs  0m34.0s/1m0s

running (0m35.0s), 900/900 VUs, 29784 complete and 0 interrupted iterations
default   [  58% ] 900 VUs  0m35.0s/1m0s

running (0m36.0s), 900/900 VUs, 30677 complete and 0 interrupted iterations
default   [  60% ] 900 VUs  0m36.0s/1m0s

running (0m37.0s), 900/900 VUs, 31573 complete and 0 interrupted iterations
default   [  62% ] 900 VUs  0m37.0s/1m0s

running (0m38.0s), 900/900 VUs, 32450 complete and 0 interrupted iterations
default   [  63% ] 900 VUs  0m38.0s/1m0s

running (0m39.0s), 900/900 VUs, 33338 complete and 0 interrupted iterations
default   [  65% ] 900 VUs  0m39.0s/1m0s

running (0m40.0s), 900/900 VUs, 34229 complete and 0 interrupted iterations
default   [  67% ] 900 VUs  0m40.0s/1m0s

running (0m41.0s), 900/900 VUs, 35090 complete and 0 interrupted iterations
default   [  68% ] 900 VUs  0m41.0s/1m0s

running (0m42.0s), 900/900 VUs, 35969 complete and 0 interrupted iterations
default   [  70% ] 900 VUs  0m42.0s/1m0s

running (0m43.0s), 900/900 VUs, 36869 complete and 0 interrupted iterations
default   [  72% ] 900 VUs  0m43.0s/1m0s

running (0m44.0s), 900/900 VUs, 37769 complete and 0 interrupted iterations
default   [  73% ] 900 VUs  0m44.0s/1m0s

running (0m45.0s), 900/900 VUs, 38669 complete and 0 interrupted iterations
default   [  75% ] 900 VUs  0m45.0s/1m0s

running (0m46.0s), 900/900 VUs, 39569 complete and 0 interrupted iterations
default   [  77% ] 900 VUs  0m46.0s/1m0s

running (0m47.0s), 900/900 VUs, 40469 complete and 0 interrupted iterations
default   [  78% ] 900 VUs  0m47.0s/1m0s

running (0m48.0s), 900/900 VUs, 41369 complete and 0 interrupted iterations
default   [  80% ] 900 VUs  0m48.0s/1m0s

running (0m49.0s), 900/900 VUs, 42269 complete and 0 interrupted iterations
default   [  82% ] 900 VUs  0m49.0s/1m0s

running (0m50.0s), 900/900 VUs, 43169 complete and 0 interrupted iterations
default   [  83% ] 900 VUs  0m50.0s/1m0s

running (0m51.0s), 900/900 VUs, 44069 complete and 0 interrupted iterations
default   [  85% ] 900 VUs  0m51.0s/1m0s

running (0m52.0s), 900/900 VUs, 44969 complete and 0 interrupted iterations
default   [  87% ] 900 VUs  0m52.0s/1m0s

running (0m53.0s), 900/900 VUs, 45858 complete and 0 interrupted iterations
default   [  88% ] 900 VUs  0m53.0s/1m0s

running (0m54.0s), 900/900 VUs, 46752 complete and 0 interrupted iterations
default   [  90% ] 900 VUs  0m54.0s/1m0s

running (0m55.0s), 900/900 VUs, 47643 complete and 0 interrupted iterations
default   [  92% ] 900 VUs  0m55.0s/1m0s

running (0m56.0s), 900/900 VUs, 48527 complete and 0 interrupted iterations
default   [  93% ] 900 VUs  0m56.0s/1m0s

running (0m57.0s), 900/900 VUs, 49417 complete and 0 interrupted iterations
default   [  95% ] 900 VUs  0m57.0s/1m0s

running (0m58.0s), 900/900 VUs, 50306 complete and 0 interrupted iterations
default   [  97% ] 900 VUs  0m58.0s/1m0s

running (0m59.0s), 900/900 VUs, 51194 complete and 0 interrupted iterations
default   [  98% ] 900 VUs  0m59.0s/1m0s

running (1m00.0s), 900/900 VUs, 52080 complete and 0 interrupted iterations
default   [ 100% ] 900 VUs  1m00.0s/1m0s

running (1m01.0s), 040/900 VUs, 52967 complete and 0 interrupted iterations
default ↓ [ 100% ] 900 VUs  1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=1.71ms min=0s      med=144.68µs max=285.75ms p(90)=3.2ms  p(95)=6.66ms 
      { expected_response:true }...: avg=3.21ms min=96.27µs med=468.8µs  max=285.75ms p(90)=6.25ms p(95)=10.02ms
    http_req_failed................: 46.73% 24775 out of 53007
    http_reqs......................: 53007  868.85342/s

    EXECUTION
    iteration_duration.............: avg=1.02s  min=1s      med=1s       max=3.58s    p(90)=1.03s  p(95)=1.08s  
    iterations.....................: 53007  868.85342/s
    vus............................: 40     min=40             max=900
    vus_max........................: 900    min=900            max=900

    NETWORK
    data_received..................: 7.6 MB 125 kB/s
    data_sent......................: 2.2 MB 36 kB/s



running (1m01.0s), 000/900 VUs, 53007 complete and 0 interrupted iterations
default ✓ [ 100% ] 900 VUs  1m0s

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmarkHummingbird.js
        output: -

     scenarios: (100.00%) 1 scenario, 900 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 900 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 900/900 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 900 VUs  0m01.0s/1m0s

running (0m02.0s), 900/900 VUs, 900 complete and 0 interrupted iterations
default   [   3% ] 900 VUs  0m02.0s/1m0s

running (0m03.0s), 900/900 VUs, 1800 complete and 0 interrupted iterations
default   [   5% ] 900 VUs  0m03.0s/1m0s

running (0m04.0s), 900/900 VUs, 2561 complete and 0 interrupted iterations
default   [   7% ] 900 VUs  0m04.0s/1m0s

running (0m05.0s), 900/900 VUs, 3268 complete and 0 interrupted iterations
default   [   8% ] 900 VUs  0m05.0s/1m0s

running (0m06.0s), 900/900 VUs, 4168 complete and 0 interrupted iterations
default   [  10% ] 900 VUs  0m06.0s/1m0s

running (0m07.0s), 900/900 VUs, 5068 complete and 0 interrupted iterations
default   [  12% ] 900 VUs  0m07.0s/1m0s

running (0m08.0s), 900/900 VUs, 5968 complete and 0 interrupted iterations
default   [  13% ] 900 VUs  0m08.0s/1m0s

running (0m09.0s), 900/900 VUs, 6868 complete and 0 interrupted iterations
default   [  15% ] 900 VUs  0m09.0s/1m0s

running (0m10.0s), 900/900 VUs, 7768 complete and 0 interrupted iterations
default   [  17% ] 900 VUs  0m10.0s/1m0s

running (0m11.0s), 900/900 VUs, 8668 complete and 0 interrupted iterations
default   [  18% ] 900 VUs  0m11.0s/1m0s

running (0m12.0s), 900/900 VUs, 9568 complete and 0 interrupted iterations
default   [  20% ] 900 VUs  0m12.0s/1m0s

running (0m13.0s), 900/900 VUs, 10468 complete and 0 interrupted iterations
default   [  22% ] 900 VUs  0m13.0s/1m0s

running (0m14.0s), 900/900 VUs, 11368 complete and 0 interrupted iterations
default   [  23% ] 900 VUs  0m14.0s/1m0s

running (0m15.0s), 900/900 VUs, 12268 complete and 0 interrupted iterations
default   [  25% ] 900 VUs  0m15.0s/1m0s

running (0m16.0s), 900/900 VUs, 13168 complete and 0 interrupted iterations
default   [  27% ] 900 VUs  0m16.0s/1m0s

running (0m17.0s), 900/900 VUs, 14068 complete and 0 interrupted iterations
default   [  28% ] 900 VUs  0m17.0s/1m0s

running (0m18.0s), 900/900 VUs, 14968 complete and 0 interrupted iterations
default   [  30% ] 900 VUs  0m18.0s/1m0s

running (0m19.0s), 900/900 VUs, 15868 complete and 0 interrupted iterations
default   [  32% ] 900 VUs  0m19.0s/1m0s

running (0m20.0s), 900/900 VUs, 16768 complete and 0 interrupted iterations
default   [  33% ] 900 VUs  0m20.0s/1m0s

running (0m21.0s), 900/900 VUs, 17668 complete and 0 interrupted iterations
default   [  35% ] 900 VUs  0m21.0s/1m0s

running (0m22.0s), 900/900 VUs, 18547 complete and 0 interrupted iterations
default   [  37% ] 900 VUs  0m22.0s/1m0s

running (0m23.0s), 900/900 VUs, 19447 complete and 0 interrupted iterations
default   [  38% ] 900 VUs  0m23.0s/1m0s

running (0m24.0s), 900/900 VUs, 20344 complete and 0 interrupted iterations
default   [  40% ] 900 VUs  0m24.0s/1m0s

running (0m25.0s), 900/900 VUs, 21243 complete and 0 interrupted iterations
default   [  42% ] 900 VUs  0m25.0s/1m0s

running (0m26.0s), 900/900 VUs, 22131 complete and 0 interrupted iterations
default   [  43% ] 900 VUs  0m26.0s/1m0s

running (0m27.0s), 900/900 VUs, 23029 complete and 0 interrupted iterations
default   [  45% ] 900 VUs  0m27.0s/1m0s

running (0m28.0s), 900/900 VUs, 23927 complete and 0 interrupted iterations
default   [  47% ] 900 VUs  0m28.0s/1m0s

running (0m29.0s), 900/900 VUs, 24822 complete and 0 interrupted iterations
default   [  48% ] 900 VUs  0m29.0s/1m0s

running (0m30.0s), 900/900 VUs, 25722 complete and 0 interrupted iterations
default   [  50% ] 900 VUs  0m30.0s/1m0s

running (0m31.0s), 900/900 VUs, 26622 complete and 0 interrupted iterations
default   [  52% ] 900 VUs  0m31.0s/1m0s

running (0m32.0s), 900/900 VUs, 27522 complete and 0 interrupted iterations
default   [  53% ] 900 VUs  0m32.0s/1m0s

running (0m33.0s), 900/900 VUs, 28422 complete and 0 interrupted iterations
default   [  55% ] 900 VUs  0m33.0s/1m0s

running (0m34.0s), 900/900 VUs, 29322 complete and 0 interrupted iterations
default   [  57% ] 900 VUs  0m34.0s/1m0s

running (0m35.0s), 900/900 VUs, 30222 complete and 0 interrupted iterations
default   [  58% ] 900 VUs  0m35.0s/1m0s

running (0m36.0s), 900/900 VUs, 31118 complete and 0 interrupted iterations
default   [  60% ] 900 VUs  0m36.0s/1m0s

running (0m37.0s), 900/900 VUs, 32013 complete and 0 interrupted iterations
default   [  62% ] 900 VUs  0m37.0s/1m0s

running (0m38.0s), 900/900 VUs, 32862 complete and 0 interrupted iterations
default   [  63% ] 900 VUs  0m38.0s/1m0s

running (0m39.0s), 900/900 VUs, 33732 complete and 0 interrupted iterations
default   [  65% ] 900 VUs  0m39.0s/1m0s

running (0m40.0s), 900/900 VUs, 34632 complete and 0 interrupted iterations
default   [  67% ] 900 VUs  0m40.0s/1m0s

running (0m41.0s), 900/900 VUs, 35532 complete and 0 interrupted iterations
default   [  68% ] 900 VUs  0m41.0s/1m0s

running (0m42.0s), 900/900 VUs, 36432 complete and 0 interrupted iterations
default   [  70% ] 900 VUs  0m42.0s/1m0s

running (0m43.0s), 900/900 VUs, 37332 complete and 0 interrupted iterations
default   [  72% ] 900 VUs  0m43.0s/1m0s

running (0m44.0s), 900/900 VUs, 38232 complete and 0 interrupted iterations
default   [  73% ] 900 VUs  0m44.0s/1m0s

running (0m45.0s), 900/900 VUs, 39120 complete and 0 interrupted iterations
default   [  75% ] 900 VUs  0m45.0s/1m0s

running (0m46.0s), 900/900 VUs, 40009 complete and 0 interrupted iterations
default   [  77% ] 900 VUs  0m46.0s/1m0s

running (0m47.0s), 900/900 VUs, 40903 complete and 0 interrupted iterations
default   [  78% ] 900 VUs  0m47.0s/1m0s

running (0m48.0s), 900/900 VUs, 41794 complete and 0 interrupted iterations
default   [  80% ] 900 VUs  0m48.0s/1m0s

running (0m49.0s), 900/900 VUs, 42684 complete and 0 interrupted iterations
default   [  82% ] 900 VUs  0m49.0s/1m0s

running (0m50.0s), 900/900 VUs, 43576 complete and 0 interrupted iterations
default   [  83% ] 900 VUs  0m50.0s/1m0s

running (0m51.0s), 900/900 VUs, 44465 complete and 0 interrupted iterations
default   [  85% ] 900 VUs  0m51.0s/1m0s

running (0m52.0s), 900/900 VUs, 45353 complete and 0 interrupted iterations
default   [  87% ] 900 VUs  0m52.0s/1m0s

running (0m53.0s), 900/900 VUs, 46242 complete and 0 interrupted iterations
default   [  88% ] 900 VUs  0m53.0s/1m0s

running (0m54.0s), 900/900 VUs, 47138 complete and 0 interrupted iterations
default   [  90% ] 900 VUs  0m54.0s/1m0s

running (0m55.0s), 900/900 VUs, 48033 complete and 0 interrupted iterations
default   [  92% ] 900 VUs  0m55.0s/1m0s

running (0m56.0s), 900/900 VUs, 48920 complete and 0 interrupted iterations
default   [  93% ] 900 VUs  0m56.0s/1m0s

running (0m57.0s), 900/900 VUs, 49813 complete and 0 interrupted iterations
default   [  95% ] 900 VUs  0m57.0s/1m0s

running (0m58.0s), 900/900 VUs, 50711 complete and 0 interrupted iterations
default   [  97% ] 900 VUs  0m58.0s/1m0s

running (0m59.0s), 900/900 VUs, 51610 complete and 0 interrupted iterations
default   [  98% ] 900 VUs  0m59.0s/1m0s

running (1m00.0s), 900/900 VUs, 52509 complete and 0 interrupted iterations
default   [ 100% ] 900 VUs  1m00.0s/1m0s

running (1m01.0s), 003/900 VUs, 53409 complete and 0 interrupted iterations
default ↓ [ 100% ] 900 VUs  1m0s


  █ TOTAL RESULTS 

    HTTP
    http_req_duration..............: avg=331.98µs min=0s      med=136.39µs max=259.99ms p(90)=863.43µs p(95)=1.73ms
      { expected_response:true }...: avg=628.08µs min=95.65µs med=202.73µs max=259.99ms p(90)=1.66ms   p(95)=2.4ms 
    http_req_failed................: 47.14% 25180 out of 53412
    http_reqs......................: 53412  875.542128/s

    EXECUTION
    iteration_duration.............: avg=1.01s    min=1s      med=1s       max=1.57s    p(90)=1.01s    p(95)=1.05s 
    iterations.....................: 53412  875.542128/s
    vus............................: 3      min=3              max=900
    vus_max........................: 900    min=900            max=900

    NETWORK
    data_received..................: 7.6 MB 125 kB/s
    data_sent......................: 2.2 MB 36 kB/s



running (1m01.0s), 000/900 VUs, 53412 complete and 0 interrupted iterations
default ✓ [ 100% ] 900 VUs  1m0s